Tekla Open API Reference for Tekla Structures 2025
FormBase.GetConnectionStatus Method
 Returns true if a proper connection to the Tekla Structures process has been established. Currently, there's no way to re-establish the connection.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetConnectionStatus()
Public Function GetConnectionStatus As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace